devTest/case/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "25";
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            greyDiffusiveRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
    }
    bottom
    {
        type            greyDiffusiveRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
    }
    top
    {
        type            greyDiffusiveRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
    }
}


// ************************************************************************* //
